WMSGIFT/src/Documents/КадровыеИзменения/КадровыеИзменения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КадровыеИзменения</name>
  <registerRecords>InformationRegister.КадровыеИзмененияРаботниковСклада</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКадровогоИзменения</name>
    <type>
      <types>EnumRef.ВидКадровогоИзменения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РаботникиСклада</name>
    <attributes>
      <name>Работник</name>
      <type>
        <types>CatalogRef.итWMSРаботникиСклада</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.ДолжностиРаботниковСклада</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

WMSGIFT/src/InformationRegisters/КадровыеИзмененияРаботниковСклада/КадровыеИзмененияРаботниковСклада.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КадровыеИзмененияРаботниковСклада</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиРаботниковСклада</types>
    </type>
  </resources>
  <resources>
    <name>ПризнакАктивности</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>РаботникСклада</name>
    <type>
      <types>CatalogRef.итWMSРаботникиСклада</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

WMSGIFT/src/Enums/ВидКадровогоИзменения/ВидКадровогоИзменения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидКадровогоИзменения</name>
  <enumValues>
    <name>УстановитьНаДолжность</name>
  </enumValues>
  <enumValues>
    <name>СнятьСДолжности</name>
  </enumValues>
</mdclass:Enum>

WMSGIFT/src/Documents/КадровыеИзменения/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	КадровыеИзмененияРаботниковСклада=Движения.КадровыеИзмененияРаботниковСклада;
	КадровыеИзмененияРаботниковСклада.Записывать=Истина;
	Для Каждого стр из РаботникиСклада Цикл 
		НоваяСтрока=КадровыеИзмененияРаботниковСклада.Добавить();
		НоваяСтрока.Регистратор=Ссылка;
		НоваяСтрока.РаботникСклада=стр.Работник;
		НоваяСтрока.Должность=стр.Должность;
		НоваяСтрока.Организация=Организация;
		НоваяСтрока.Период=Дата;
		Если ВидКадровогоИзменения=Перечисления.ВидКадровогоИзменения.УстановитьНаДолжность Тогда 
			НоваяСтрока.ПризнакАктивности=Истина;
		иначе
			НоваяСтрока.ПризнакАктивности=Ложь;
		КонецЕсли;	
	КонецЦикла;
	КадровыеИзмененияРаботниковСклада.Записать();
КонецПроцедуры



Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если не	ПроверитьЗаполнение()  Тогда 
		Отказ=Истина;
	КонецЕсли;	

КонецПроцедуры
